print(5) # команда для вывода информации на экран
print(type(5)) # команда для определения типа данных, INT - тип данных числа
print(5 + 5) # сложение "+"
print(5 - 5) # вычитание "-"
print(5 * 5) # умножение "*"
print(5 / 5) # простое деление "/"
print(5 // 5) # целочисленное деление "//"
print(5 % 5) # найти остаток от деления "%"
print(5 ** 5) # озведение в степень "**"
print(2.0) # вывод на экран дробного число
print(type(2.0)) # тип числа "float" - числа с плавающей точкой
print(5 + 2.2) # при сложении INT+FLOAT получается FLOAT
print('Hello, world!') # текст всегда выводится в кавычках (1 или 2)
print(type('Hello, world!')) # тип данных "STR" - "STRING" - строка (текст)
print('Hello,' + 'world!') # строки можно ТОЛЬКО складывать!!!
print(True, False) # логический тип данных: либо ложь, либо правда
print(type(True), type(False)) # тип данных "bool" от "boolean"
print(5 > 10, 10 > 5) # применяется как сигнал для выполнения какого-либо действия
print(5, 'запятая - разделитель') # PRINT может выводить сразу разные типы данных (через запятую)
print(5 <= 10) # меньше или равно
print(5 >= 10) # больше или равно
print(5 == 10) # проверка равенства
print(5 != 10) # проверка неравенства
print(5 != 5 and 5 < 10) # можно составлять сложные выражения используя AND и OR
print(int('5')) # команда для смены типа данных пишется как тип нужных данных
print(type(int('5'))) #проверим тип данных после изменения